nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB2/KW47B42ZB2_cm33_core0.xml
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMCTL[%s]</name>
          <description>Timer Control</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TIMOD</name>
              <description>Timer Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Timer disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dual8bit_baud</name>
                  <description>Dual 8-bit counters baud mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dual8bit_pwm_h</name>
                  <description>Dual 8-bit counters PWM high mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>single16bit</name>
                  <description>Single 16-bit counter mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>single16bit_disable</name>
                  <description>Single 16-bit counter disable mode</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dual8bit_word</name>
                  <description>Dual 8-bit counters word mode</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>dual8bit_pwm_l</name>
                  <description>Dual 8-bit counters PWM low mode</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>single16bit_in_capture</name>
                  <description>Single 16-bit input capture mode</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ONETIM</name>
              <description>Timer One Time Operation</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>not_blocked</name>
                  <description>Generate the timer enable event as normal</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>blocked</name>
                  <description>Block the timer enable event unless the timer status flag is clear</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PININS</name>
              <description>Timer Pin Input Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pinsel</name>
                  <description>PINSEL selects timer pin input and output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pinselplus1</name>
                  <description>PINSEL + 1 selects the timer pin input; timer pin output remains selected by PINSEL</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINPOL</name>
              <description>Timer Pin Polarity</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active_high</name>
                  <description>Active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>active_low</name>
                  <description>Active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINSEL</name>
              <description>Timer Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PINCFG</name>
              <description>Timer Pin Configuration</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>outdisable</name>
                  <description>Timer pin output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>opend_bidirouten</name>
                  <description>Timer pin open-drain or bidirectional output enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bidir_outdata</name>
                  <description>Timer pin bidirectional output data</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>output</name>
                  <description>Timer pin output</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSRC</name>
              <description>Trigger Source</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ext_trig</name>
                  <description>External</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>internal_trig</name>
                  <description>Internal</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGPOL</name>
              <description>Trigger Polarity</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>active_high</name>
                  <description>Active high</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>active_low</name>
                  <description>Active low</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>Trigger Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMCFG[%s]</name>
          <description>Timer Configuration</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TSTART</name>
              <description>Timer Start</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disable</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSTOP</name>
              <description>Timer Stop</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>stop_disable</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable_tmrcmp</name>
                  <description>Enabled on timer compare</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable_tmrdisable</name>
                  <description>Enabled on timer disable</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enable_tmr_cmp_dis</name>
                  <description>Enabled on timer compare and timer disable</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMENA</name>
              <description>Timer Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>enable</name>
                  <description>Timer always enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_nminus1_en</name>
                  <description>Timer enabled on timer n-1 enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_trighi_en</name>
                  <description>Timer enabled on trigger high</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_trig_pin_hi_en</name>
                  <description>Timer enabled on trigger high and pin high</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_pinrise_en</name>
                  <description>Timer enabled on pin rising edge</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_pinrise_trighi_en</name>
                  <description>Timer enabled on pin rising edge and trigger high</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_trigrise_en</name>
                  <description>Timer enabled on trigger rising edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_trigedge_en</name>
                  <description>Timer enabled on trigger rising or falling edge</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMDIS</name>
              <description>Timer Disable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>never</name>
                  <description>Timer never disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_nminus1</name>
                  <description>Timer disabled on timer n-1 disable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_cmp</name>
                  <description>Timer disabled on timer compare (upper 8 bits match and decrement)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_cmp_triglow</name>
                  <description>Timer disabled on timer compare (upper 8 bits match and decrement) and trigger low</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_edge</name>
                  <description>Timer disabled on pin rising or falling edge</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_edge_trighi</name>
                  <description>Timer disabled on pin rising or falling edge provided trigger is high</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_falledge</name>
                  <description>Timer disabled on trigger falling edge</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMRST</name>
              <description>Timer Reset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>never</name>
                  <description>Never reset timer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tmr_out_hi</name>
                  <description>Timer reset on timer output high.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_eq_tmr_out</name>
                  <description>Timer reset on timer pin equal to timer output</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_eq_tmr_out</name>
                  <description>Timer reset on timer trigger equal to timer output</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_rise_edge</name>
                  <description>Timer reset on timer pin rising edge</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_rise_edge</name>
                  <description>Timer reset on trigger rising edge</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_edge</name>
                  <description>Timer reset on trigger rising or falling edge</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMDEC</name>
              <description>Timer Decrement</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>flexio_clk_shiftclk_tmr_out</name>
                  <description>Decrement counter on FLEXIO clock; shift clock equals timer output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_edge_shiftclk_tmr_out</name>
                  <description>Decrement counter on trigger input (both edges); shift clock equals timer output</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_edge_shiftclk_tmr_out</name>
                  <description>Decrement counter on pin input (both edges); shift clock equals pin input</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_edge_shiftclk_trig_in</name>
                  <description>Decrement counter on trigger input (both edges); shift clock equals trigger input</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flexio_clk_div16_shiftclk_tmr_out</name>
                  <description>Decrement counter on FLEXIO clock divided by 16; shift clock equals timer output</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>flexio_clk_div256_shiftclk_tmr_out</name>
                  <description>Decrement counter on FLEXIO clock divided by 256; shift clock equals timer output</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pin_rise_shiftclk_pin_in</name>
                  <description>Decrement counter on pin input (rising edge); shift clock equals pin input</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>trig_rise_shiftclk_trig_in</name>
                  <description>Decrement counter on trigger input (rising edge); shift clock equals trigger input</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIMOUT</name>
              <description>Timer Output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>one</name>
                  <description>Logic one when enabled; not affected by timer reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero</name>
                  <description>Logic zero when enabled; not affected by timer reset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>one_tmrreset</name>
                  <description>Logic one when enabled and on timer reset</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>zero_tmrreset</name>
                  <description>Logic zero when enabled and on timer reset</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TIMCMP[%s]</name>
          <description>Timer Compare</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>Timer Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFNBS[%s]</name>
          <description>Shifter Buffer Nibble Byte Swapped</description>
          <addressOffset>0x680</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNBS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFHWS[%s]</name>
          <description>Shifter Buffer Halfword Swapped</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFHWS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFNIS[%s]</name>
          <description>Shifter Buffer Nibble Swapped</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFNIS</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SHIFTBUFOES[%s]</name>
          <description>Shifter Buffer Odd Even Swapped</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SHIFTBUFOES</name>
              <description>Shift Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
