nxp-mcuxpresso/mcux-soc-svd/KW47B42ZB2/KW47B42ZB2_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>RADIO_CTRL</name>
      <description>RADIO_MISC</description>
      <groupName>RADIO_CTRL</groupName>
      <baseAddress>0x48A06000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>LL_CTRL</name>
          <description>LL Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE_LL</name>
              <description>link layer control register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACTIVE_LL_0</name>
                  <description>Bluetooth LE LL is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_LL_2</name>
                  <description>GENERIC LL is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE_LL_3</name>
                  <description>Disabled (default)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_CTRL</name>
          <description>Radio Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RBME_MODE_OVRD_EN</name>
              <description>RBME Mode Override Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RBME_MODE_OVRD_EN_0</name>
                  <description>RBME Mode Override Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RBME_MODE_OVRD_EN_1</name>
                  <description>RBME Mode Override Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBME_MODE_OVRD</name>
              <description>RBME Mode Override</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_CON_EN_OVRD_EN</name>
              <description>rx_con_en Override Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RX_CON_EN_OVRD_EN_0</name>
                  <description>rx_con_en Override Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX_CON_EN_OVRD_EN_1</name>
                  <description>rx_con_en Override Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RX_CON_EN_OVRD</name>
              <description>rx_con_en Override</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_LR_EN_OVRD_EN</name>
              <description>ble_lr_en Override Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLE_LR_EN_OVRD_EN_0</name>
                  <description>ble_lr_en Override Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLE_LR_EN_OVRD_EN_1</name>
                  <description>ble_lr_en Override Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLE_LR_EN_OVRD</name>
              <description>ble_lr_en Override</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RIF_SEL_2MBPS_OVRD_EN</name>
              <description>rif_sel_2mbps Override Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RIF_SEL_2MBPS_OVRD_EN_0</name>
                  <description>rif_sel_2mbps Override Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIF_SEL_2MBPS_OVRD_EN_1</name>
                  <description>rif_sel_2mbps Override Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RIF_SEL_2MBPS_OVRD</name>
              <description>rif_sel_2mbps Override</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WOR_RX_FAIL_WAKEUP_EN</name>
              <description>WOR RX Fail Wakeup Enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WOR_RX_FAIL_WAKEUP_EN_0</name>
                  <description>The wor_rx_fail interrupt doesn't assert rfmc_wakeup.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_RX_FAIL_WAKEUP_EN_1</name>
                  <description>The wor_rx_fail interrupt asserts rfmc_wakeup.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRIC_WAKEUP_EN</name>
              <description>BRIC Wakeup Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BRIC_WAKEUP_EN_0</name>
                  <description>The BRIC interrupt doesn't assert rfmc_wakeup.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BRIC_WAKEUP_EN_1</name>
                  <description>The BRIC interrupt asserts rfmc_wakeup.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENERIC_WAKEUP_EN</name>
              <description>Generic LL Wakeup Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GENERIC_WAKEUP_EN_0</name>
                  <description>The Generic LL interrupt doesn't assert rfmc_wakeup.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GENERIC_WAKEUP_EN_1</name>
                  <description>The Genecir LL interrupt asserts rfmc_wakeup.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZIGBEE_WAKEUP_EN</name>
              <description>Zigbee LL Wakeup Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZIGBEE_WAKEUP_EN_0</name>
                  <description>The Zigbee LL interrupt doesn't assert rfmc_wakeup.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZIGBEE_WAKEUP_EN_1</name>
                  <description>The Zigbee LL interrupt asserts rfmc_wakeup.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
